public class BitOperator02 {
	public static void main(String[] args) {
		int a = 1 >> 2;
		//      1 => 00000000 00000000 00000000 00000001
		//1 >> 2  => 00000000 00000000 00000000 00000000 01 低位溢出 符号位不变,并用符号位补溢出的高位
		//       结果为 0
		System.out.println(a); // 0

		int c = 1 << 2;
		//      1 => 00000000 00000000 00000000 00000001
		// 1 << 2 => 000000 00000000 00000000 0000000100 符号位不变 低位补0
		System.out.println(c); // 4

		System.out.println(-10.5 % 3); // a % b 当a是小数时,公式 = a-(int)a / b * b
		//  -10.5 % 3 = -10.5 - (-10) /3 * 3 = -10.5 + 9 = -1.5
		// 注意:有小数运算,得到结果时近似值

		int i = 66;
		System.out.println(++i + i); // 134
	}
}